IDEA StatiCa Open Model
AnchorParam Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Parameter which represts the record of the anchor in IDEA MPRL
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Parameters.MprlRecord
 IdeaRS.OpenModel.Parameters.BoltParam
 IdeaRS.OpenModel.Parameters.AnchorParam
 Namespace: IdeaRS.OpenModel.Parameters
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
[SerializableAttribute]
public class AnchorParam : BoltParam
<SerializableAttribute>
Public Class AnchorParam
	Inherits BoltParam
[SerializableAttribute]
public ref class AnchorParam : public BoltParam
The AnchorParam type exposes the following members.
Constructors
Name | Description
AnchorParam
Initializes a new instance of the AnchorParam class
Top
Properties
Name | Description
Angles
 Gets or sets the groups and positions for angles.
 (Inherited from BoltParam.)
AnchorTypeData
 Gets or sets the various type of anchor.
AnchorTypeSize
 Gets or sets the size of washer plate.
BoltInteraction
 Indicates type of shear transfer
 (Inherited from BoltParam.)
Cols
 Gets or sets the columns of fasteners positions.
 (Inherited from BoltParam.)
ColsGridType
 Gets or sets the type of cols - regular or shifted.
 (Inherited from BoltParam.)
ColsNegative
 Gets or sets the rows of a negative fasteners positions in case of RowsPosition equals to Profile. Absolute positions of groups, in group are relative positions.
 (Inherited from BoltParam.)
ColsPosition
 Gets or sets the position, to which are bolt columns realted to.
 (Inherited from BoltParam.)
ColsSymmetry
 Gets or sets the type of symmetry of columns positions.
 (Inherited from BoltParam.)
CoordinateSystem
 Gets or sets the coordinate system type.
 (Inherited from BoltParam.)
Counts
 Gets or sets the count of bolts in the circle (polar coordinate system).
 (Inherited from BoltParam.)
ItemId
 Mprl ItemId
 (Inherited from MprlRecord.)
Length
 Gets or sets the anchor length.
Name
 Name of the item
 (Inherited from MprlRecord.)
PolarInput
 Gets or sets the type, that spefifies polar input.
 (Inherited from BoltParam.)
PolarPosition
 Gets or sets the position, to which are bolt radii realted to (polar coordinate system).
 (Inherited from BoltParam.)
Positions
 Gets or sets the fasteners positions {X, Y}.
 (Inherited from BoltParam.)
Radii
 Gets or sets the radii of bolts (polar coordinate system).
 (Inherited from BoltParam.)
Rows
 Gets or sets the rows of a fasteners positions. Absolute positions of groups, in group are relative positions.
 (Inherited from BoltParam.)
RowsGridType
 Gets or sets the type of rows - regular or shifted.
 (Inherited from BoltParam.)
RowsNegative
 Gets or sets the rows of a negative fasteners positions in case of RowsPosition equals to Profile. Absolute positions of groups, in group are relative positions.
 (Inherited from BoltParam.)
RowsPosition
 Gets or sets the position, to which are bolt rows realted to.
 (Inherited from BoltParam.)
RowsSymmetry
 Gets or sets the type of symmetry of rows positions.
 (Inherited from BoltParam.)
ShearInThread
 Indicates, whether a shear plane is in the thread of a bolt.
 (Inherited from BoltParam.)
TableId
 Mprl TableId
 (Inherited from MprlRecord.)
Top
See Also
Reference
IdeaRS.OpenModel.Parameters Namespace